import pandas as pd
import requests
import json
import numpy as np
from tqdm import tqdm

import datetime,time
import akshare as ak

#查询社保基金



class Getdata():
    def __init__(self,stock_df):
        self.stock_df = stock_df


    #近三个交易日的涨跌幅
    def shebao(self):
        bank =[]
        for i in tqdm(self.stock_df['证券代码']):
            symbol = 'sh' + i[:6] if i[0] == "6" else 'sz' + i[:6]
            try:
                stock_lt_top_10_em_df = ak.stock_gdfx_free_top_10_em(symbol=symbol, date=end_date)
                stock_top_10_em_df = ak.stock_gdfx_top_10_em(i, date=end_date)
                data = pd.concat([stock_lt_top_10_em_df, stock_top_10_em_df])
                data['证券代码'] = i
                bank.append(data)
            except:
                continue
        result = pd.concat(bank)
        result = result[result['股东名称'].str.contains('社保')]
        result['占总流通股本持股比例'] = round(result['占总流通股本持股比例'],2)
        result['变动比率'] = round(result['变动比率'], 2)
        # print(result.columns,result)
        return result

    def data_procss(self):
        try:
            shebao = self.shebao()
            final_data = pd.merge(self.stock_df, shebao, on='证券代码', how='right')
            final_data = final_data.sort_values(by=['一级行业', '二级行业', '三级行业', '证券代码'])
            final_data = final_data.drop_duplicates(subset=['股东名称','持股数'])
            # final_data = final_data.dropna()
            final_data = final_data.drop(['名次','占总股本持股比例'], axis=1)

            final_data = final_data.reset_index(drop=True)
        except Exception as e:
            print(f"Error merging profit data: {e}")
        return final_data

if __name__ == '__main__':
    hyppb = pd.read_excel('行业匹配表.xlsx')
    #财报日期
    end_date ='20240331'

    #此时跑代码的时间
    today = '20240522'
    # 接收用户输入:输入'二级行业'或者'三级细分'
    # 概念
    gainian = ['人脑工程', '转基因', '粮食概念', '地热能', '低碳冶金', '机器人执行器', '券商概念', '在线旅游', '中特估',
               '科创板做市商', '核污染防治', 'GDR', '航母概念', '农业种植', '抽水蓄能', '海洋经济', '光伏高速公路',
               '液冷概念','同步磁阻电机', '绿色电力', '超超临界发电', 'IPv6', '华为欧拉', '钒电池', '东盟自贸区概念', 'AH股',
               '跨境支付','阿兹海默', '基本金属', '中字头', '生物质能发电', '小米汽车', 'RCEP概念', 'IPO受益', '参股期货',
               '钛白粉','医废处理', '碳交易', '央企改革', '胎压监测', '磷化工', '东北振兴', '煤化工', '证金持股', '油气设服',
               '中证500', '广电', '减速器', '上证50_', '生态农业', '疫苗冷链', '草甘膦', '页岩气', '风能', '新能源', '水产养殖',
               '人造太阳','轮毂电机', '汽车拆解', '稀缺资源', '空气能热泵', '核能核电', '分拆预期', '央视50_', '乡村振兴',
               'REITs概念','熔盐储能', '水利建设', 'MSCI中国', '换电概念', '参股券商', '破净股', '量子通信', '2025规划', '无线充电',
               '星闪概念', '青蒿素', '数据确权', '湖北自贸', '汽车一体化压铸', '工业母机', '血氧仪', '深成500',
               '上证380','发电机概念','一带一路',
               '无人驾驶', '重组蛋白', '海工装备', '天然气', '创业成份', '刀片电池', '虚拟电厂', '上证180_',
               '飞行汽车(eVTOL)', '商汤概念', 'HS300_', '京东金融', '国企改革', '军民融合', '债转股', 'PVDF概念',
               '第四代半导体','储能','标准普尔', '可燃冰', '维生素', '油价相关', '沪股通', '富时罗素', '净水概念', '互联金融', '土壤修复',
               '互联医疗', '多模态AI', '大飞机', '钙钛矿电池', '蚂蚁概念', '充电桩', 'PPP模式', '鸡肉概念', '超导概念',
               '地摊经济', '京津冀', '黄金概念', '民爆概念', '深证100R', 'B股', '麒麟电池', '小金属概念', '深股通',
               'VPN','汽车热管理', '高压快充', '单抗概念', '参股新三板', '基金重仓', '环氧丙烷', '铁路基建', '燃料电池','屏下摄像',
               'EDA概念', '基因测序', '纾困概念', '无线耳机', '猪肉概念', '参股银行', '啤酒概念', 'MLCC', '地下管网','参股保险',
               '退税商店', '氢能源', '盐湖提锂', '创投', '化工原料', 'ChatGPT概念', 'CAR-T细胞疗法', '彩票概念',
               '雄安新区','共享经济', '北交所概念', 'RCS概念', '军工', '激光雷达', '免疫治疗', '成渝特区', 'PLC概念', '新能源车',
               'AIGC概念','降解塑料', '华为汽车', '股权激励', '垃圾分类', '节能环保', '生物疫苗', '智能电网', '工业互联',
               '社保重仓','土地流转', '太阳能', '超清视频', '传感器', '长江三角', 'UWB概念', '调味品概念', '3D玻璃', 'MLOps概念',
               '特斯拉','智能机器', '机器人概念', '边缘计算', '乳业', '空间站概念', '航天概念', '独角兽', '气溶胶检测',
               '工业4.0','人造肉', '新冠检测', '食品安全', '养老金', '融资融券', '电子烟', '信创', '预盈预增', 'Web3.0', '车联网',
               '氮化镓','数据中心', '电子后视镜', '智能穿戴', '低价股', '超级电容', '尾气治理', '动力电池回收', '注射器概念',
               '阿里概念','远程办公', '电子车牌', '算力概念', '通用航空', '智能电视', '独家药品', '毛发医疗', '复合集流体',
               '机器视觉','苹果概念','辅助生殖','天基互联','电子纸概念','数字孪生',
               '送转预期', '体外诊断', '小米概念', '幽门螺杆菌概念', '云计算', '快递概念', '抗原检测', '物联网',
               '无人机', '固态电池', '存储芯片', '被动元件', '精准医疗', '转债标的', '国产软件', '大数据', '北斗导航',
               '华为概念', '知识产权', '国家安防', '数字水印', '医疗器械概念', '东数西算', '培育钻石', '特高压',
               '高送转', '粤港自贸', '核酸采样亭', '智能家居', '杭州亚运会', '汽车芯片', '区块链', '网络安全', '石墨烯',
               '预制菜概念', '3D摄像头', '健康中国', '人工智能', '网红直播', '5G概念', '数据要素', '鸿蒙概念',
               '华为昇腾', '百度概念', '病毒防治', '代糖概念', '百元股', '熊去氧胆酸', '锂电池', '磁悬浮概念', '创新药',
               '数字哨兵', '生物识别', '数字经济', 'PCB', '抗菌面料', '拼多多概念', '工业气体', 'AB股', '肝炎概念',
               '医疗美容', '茅指数', '口罩', '深圳特区', '氟化工', '电商概念', 'LED', 'TOPCon电池', '海绵城市', 'CRO',
               '元宇宙概念', '第三代半导体', '光伏建筑一体化', '世界杯', '供销社概念', '肝素概念', '新零售', '内贸流通',
               '6G概念','蝗虫防治', '虚拟数字人', '专精特新', '碳基材料', '3D打印', '智慧城市', '工程机械概念', '痘病毒防治',
               '新型工业化','影视概念','C2M概念','全息技术','WiFi','低空经济',
               '数字阅读', '北京冬奥', '电子身份证', '钠离子电池', '毫米波概念', '时空大数据', '智慧政务', '国产芯片',
               '新材料', '数字货币', 'ETC', '数据安全', '流感', '举牌', '国资云概念', '碳化硅', '工业大麻', '冷链物流',
               '噪声防治', '蒙脱石散', '短剧互动游戏', '虚拟现实', '超级真菌', '消毒剂', '预亏预减', 'OLED', '植物照明',
               '新冠药物', '贬值受益', '中药概念', '统一大市场', 'BC电池', '创业板综', '新型城镇化', '蓝宝石',
               '长寿药', '增强现实', '万达概念', '机构重仓', '白酒', 'NFT概念', '富士康', '快手概念', '空间计算',
               '免税概念', '养老概念', '超级品牌', '科创板做市股', 'MicroLED', '装配建筑', '职业教育', 'EDR概念',
               '混合现实', '字节概念','半导体概念', '稀土永磁', '体育产业', 'MiniLED', 'PEEK材料概念', 'DRG/DIP',
               '在线教育', 'ERP概念','壳资源', '婴童概念', '赛马概念', '社区团购', '中俄贸易概念', '宠物经济', '中超概念', '移动支付',
               '股权转让', '智慧灯杆','沪企改革','手游概念',
               'ST股', '滨海新区', '户外露营', 'QFII重仓', 'AI芯片', '地塞米松', '有机硅', '宁组合', '裸眼3D',
               '抖音小店', '千金藤素', 'IGBT概念', '氦气概念', 'HIT电池', '减肥药', '网络游戏', '电子竞技', '云游戏',
               '中芯概念', 'F5G概念', '化妆品概念', 'CPO概念', '租售同权', '光通信模块', '建筑节能', '纳米银',
               '托育服务', '光刻机(胶)', '跨境电商', 'SPD概念', '上海自贸', '盲盒经济', '昨日连板_含一字', '次新股',
               '注册制次新股', '昨日涨停_含一字', 'eSIM', '进口博览', '高带宽内存', 'Chiplet概念', '昨日触板',
               '昨日涨停']


    print('\033[91m请输入D50或者概念：\033[0m')
    sheet_name = input()
    if sheet_name=='D50':
        df =pd.read_excel('D50---二季度股票池V2.xlsx')
        # print(df)
        # df = df.drop('Unnamed: 0', axis=1)
        df = df[['一级行业', '二级行业', '三级行业', '证券代码', '证券名称']]
        stock_df =df.copy()
    elif sheet_name in gainian:
        print('正在查询概念成分股')
        df = ak.stock_board_concept_cons_em(symbol=sheet_name)
        # 提取所需列
        df['证券代码'] = df['代码'].astype(str).str.zfill(6)
        # 和行业匹配表匹配,并取所需的列
        df['证券代码'] = df['代码'].apply(lambda X: X[:6] + '.SH' if X[0] == "6" else X[:6] + '.SZ')
        # 取0，3，6开头的股票
        df = df[df['证券代码'].astype(str).str.startswith(('0', '3', '6'))]
        df = pd.merge(df, hyppb, on='证券代码', how='left')
        df = df[['一级行业', '二级行业', '三级行业', '证券代码', '证券名称']]
        # print(df)
        stock_df = df.copy()

    data = Getdata(stock_df)
    final_data = data.data_procss()
    print(final_data)
    final_data.to_excel(today+sheet_name+'_社保资金.xlsx',sheet_name='社保资金',index=False)


